Revit 2027 API
SizingOptions.ProfileType Property
 The profile type of the options, such as round, rectangular or oval.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorProfileType ProfileType { get; set; }
Public Property ProfileType As ConnectorProfileType
	Get
	Set
public:
property ConnectorProfileType ProfileType {
	ConnectorProfileType get ();
	void set (ConnectorProfileType value);
}
member ProfileType : ConnectorProfileType with get, set
Property Value
ConnectorProfileType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace